Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་དུ་ཞེ་སྡང་དང་བཅས་པ་དང་། ཞེ་སྡང་མེད་པ་དང་། གཏི་མུག་དང་བཅས་པ་དང་། གཏི་མུག་མེད་པ་དང་། སྲེད་པ་དང་བཅས་པ་དང་། སྲེད་པ་མེད་པ་དང་། ལེན་པ་དང་བཅས་པ་དང་། ལེན་པ་མེད་པ་དང་། ཉོན་མོངས་པ་དང་བཅས་པ་དང་། ཉོན་མོངས་པ་མེད་པ་དང་། ཚད་དང་ལྡན་པ་དང་། ཚད་དང་མི་ལྡན་པ་དང་། མཉམ་པར་བཞག་པ་དང་།
en: Similarly, they are precisely aware of angry minds and minds free of anger, dull minds and minds free of dullness, minds with craving and minds free of craving, minds that grasp and minds free of grasping, minds affected by the afflictive emotions and minds that are unafflicted, minds that are reliable and minds that are unreliable, minds in meditative composure and minds that are uncomposed, and minds that are liberated and minds that are not liberated.

source: མཉམ་པར་མ་བཞག་པ་དང་། རྣམ་པར་གྲོལ་བའི་སེམས་དང་། རྣམ་པར་མ་གྲོལ་བའི་སེམས་ཀྱང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ། ཤེས་ནས་ཀྱང་སེམས་ཅན་སེམས་རྣམ་པར་མ་གྲོལ་བ་རྣམས་ལ་ཁོང་ཁྲོ་བར་ཡང་མི་བྱེད།
en: Even though they know this, they do not become angry with beings whose minds are not liberated, nor do they become enamored with those whose minds are liberated.

source: སེམས་རྣམ་པར་གྲོལ་བ་རྣམས་ལ་རྗེས་སུ་ཆགས་པར་ཡང་མི་བྱེད་དེ། གཞན་དུ་ན་སེམས་རྣམ་པར་གྲོལ་བ་རྣམས་ལ་བྱམས་པ་ཆེན་པོ་རྙེད་དོ། །སེམས་རྣམ་པར་མ་གྲོལ་བ་རྣམས་ལ་སྙིང་རྗེ་ཆེན་པོ་རྙེད་དོ། །
en: Instead, they discover great compassion for those whose minds are not liberated, and they discover great love for those whose minds are liberated.

source: སེམས་ཅན་ཐམས་ཅད་ཤེས་ཀྱང་སེམས་དེ་ལ་སེམས་དེས་སྙེམས་པ་ཡང་མེད། རློམ་སེམས་ཀྱང་མེད་དོ། །
en: Even though they know all minds, those minds do not cause them to be arrogant or proud toward those minds.

source: དེ་ཕ་རོལ་གྱི་སེམས་ཤེས་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་དང་སྤྱོད་པ་རབ་ཏུ་ཤེས་སོ། །སེམས་ཅན་དེ་དག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་དེས་སྐབས་མ་ཕྱེའི་བར་དུ་མི་ཤེས་ཏེ།
en: By knowing the minds of others, bodhisattvas are aware of the minds and deeds of all beings; those beings know nothing until given the opportunity by those bodhisattvas.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ལྷའི་ཡེ་ཤེས་ཀྱིས་ཀྱང་མི་ཤེས་ན་ཕལ་པ་གཞན་རྣམས་ཀྱིས་ཤེས་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: If even śrāvakas and pratyekabuddhas do not know the minds of others through their divine wisdom, there is no need to mention whether they are known by ordinary people.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་གྱི་སེམས་ཤེས་པའོ། །
en: This is a bodhisattva’s knowledge of the minds of others.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདག་དང་སེམས་ཅན་གཞན་རྣམས་ཀྱི་སྔོན་གྱི་གནས་རྣམ་པ་དུ་མ་རྗེས་སུ་དྲན་ཏེ། དེ་སྐྱེ་བ་གཅིག་ཀྱང་རྗེས་སུ་དྲན་ནོ། །
en: “A bodhisattva can recall various kinds of previous states, both their own and those of other beings.

source: སྐྱེ་བ་གཉིས་དང་སྐྱེ་བ་བརྒྱ་དང་སྐྱེ་བ་སྟོང་དང་། སྐྱེ་བ་བརྒྱ་ཕྲག་སྟོང་ནས། སྐྱེ་བ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་གྲངས་མེད་པ་རྗེས་སུ་དྲན་ནོ། །
en: They recall a single life, two lives, a hundred lives, a thousand lives, a hundred thousand lives, all the way up to an infinite and incalculable number of millions upon billions of lives.

source: འཇིག་པའི་བསྐལ་པ་ཡང་རྗེས་སུ་དྲན་ནོ། །འཆགས་པའི་བསྐལ་པ་ཡང་རྗེས་སུ་དྲན་ནོ། །
en: They recall eons of dissolution and eons of formation.

source: འཇིག་པ་དང་འཆགས་པའི་བསྐལ་པ་ཡང་རྗེས་སུ་དྲན་པ་ནས་བསྐལ་པ་ཆེན་པོ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དཔག་ཏུ་མེད་གྲངས་མེད་པའི་བར་དུ་རྗེས་སུ་དྲན་ཏེ།
en: Recalling these eons of dissolution and formation, they recall up to an infinite and incalculable number of millions upon billions of great eons.

source: དྲན་པ་དེ་ལ་དེ་བཞིན་གཤེགས་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་ས་བཅུ་ལ་རབ་ཏུ་གནས་པ་རྣམས་མ་གཏོགས་པར་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་མྱོས་པར་འགྱུར་རོ། །
en: Worldly beings and the gods would be driven mad at this recollection, whereas thus-gone ones and bodhisattvas on the ten bodhisattva levels are not.

source: འདི་ལྟར་བདག་ཆེ་གེ་མོ་ཞིག་ཏུ་འདི་འདྲ་བར་གྱུར་ཏེ།
en: “A bodhisattva recalls, ‘I was a person named so-and-so.

source: རིགས་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ། མདོག་ནི་འདི་ལྟ་བུ། མིང་ནི་འདི་ཞེས་བྱ།
en: I belonged to this clan and that family, was of this caste, and had that name.

source: ཁ་ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ། ཚེའི་གནས་པ་ནི་འདི་སྲིད་ཅིག་ཐུབ།
en: I ate this kind of food, my life lasted that long, and my body was of these proportions.

source: ཆུ་ཞེང་ནི་འདི་ལྟ་བུ་བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་སྟེ།
en: I experienced such-and-such happiness and such-and-such suffering.

source: བདག་དེ་ནས་ཤི་འཕོས་ནས་ག་གེ་མོ་ཞིག་ཏུ་སྐྱེས།
en: I died and passed on from there and was born in such-and-such place.

source: དེ་ནས་ཀྱང་ཤི་འཕོས་ནས་འདིར་སྐྱེས་ཏེ། རིགས་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ། མདོག་ནི་འདི་ལྟ་བུ། མིང་ནི་འདི་ཞེས་བྱ།
en: I again died and passed on from there and was born here in this clan, that family, this caste, and had that name.

source: ཁ་ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ། ཚེ་ནི་འདི་ཙམ་ཞིག་ཏུ་ཐུབ། ཆུ་ཞེང་ནི་འདི་ལྟ་བུ།
en: I ate this kind of food, my life lasted that long, and my body was of these proportions.

source: བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་མྱོང་ངོ་ཞེས་རྗེས་སུ་དྲན་ཏེ།
en: I experienced such-and-such happiness and such-and-such suffering.’

source: བདག་གི་ཇི་ལྟ་བར་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡང་དེ་བཞིན་ཏེ། ཐ་ན་སྦྲང་བུ་དང་གྲོག་མ་རྣམས་ཀྱི་ཡང་རྗེས་སུ་དྲན་ནོ། །དེའི་དྲན་པ་དེ་ཆགས་པ་མེད་པ། རྒྱུན་མི་འཆད་པ། སྒྲིབ་པ་མེད་པ། ཐོགས་པ་མེད་ལ། དུས་སུ་བསྐུལ་པ་མེད་པ།
en: They recall the previous states of all beings, even flies and ants, as they do their own.

source: བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་རབ་ཏུ་ལྡན་པ་ཟབ་པ་གཏིང་དཔག་དཀའ་བ། བག་ལ་ཉལ་མེད་པ། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་རྣམ་པར་དག་པ་བསོད་ནམས་དང་། ཡེ་ཤེས་ཀྱི་ཚོགས་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་སྟེ།
en: Their recollection is without attachment, uninterrupted, unobscured, unobstructed, unhurried, suffused with great love and compassion, profound, difficult to fathom, free of latent impressions, clear of the nexus of habitual patterns, and graced by the complete collection of merit and wisdom.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་ཤེས་པ་ཞེས་བྱའོ། །
en: This is what is called a bodhisattva’s recall of previous states.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྫུ་འཕྲུལ་བྱ་བའི་ཤེས་པ་ནི་བསོད་ནམས་དང་ཡེ་ཤེས་ཐམས་ཅད་ཀྱིས་བསྟན་པ།
en: “A bodhisattva’s capacity to create miraculous emanations is made stable by the complete collection of merit and wisdom.

source: སྒྲིབ་པ་མེད་པ། ལྷུན་གྱིས་གྲུབ་པ། རྣམ་པར་མ་བརྟགས་པ། བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་གྲངས་མེད་པར་སྦྱིན་པ་དང་དུལ་བ་དང་མི་འགྱུར་བ་དང་།
en: It is unobscured, effortless, unfabricated, magnanimous, disciplined, and unchanging for an incalculable number of millions upon billions of eons.

source: ཡང་དག་པར་སྡོམ་པ་དང་།
en: It is restrained, and has been cultivated through gentleness, meditative stability, samādhi, and meditative attainment.

source: ངེས་པ་དང་བསམ་གཏན་དང་ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པས་ཡོངས་སུ་སྦྱང་བ་བྱས་པ་བདག་དང་སངས་རྒྱས་དང་ལྷའི་དབང་དང་ལྡན་པ་སྟེ།
en: It is suffused with their own power, and the power of buddhas and gods.

source: དེ་རྫུ་འཕྲུལ་མངོན་དུ་གྱུར་པ། མངོན་པར་འདུ་བྱ་བ་མེད་པ། སྒྲིབ་པ་མེད་པ་འཇིག་རྟེན་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ་དེས་སེམས་ཅན་རྣམས་ཀྱི་དོན་བྱེད་དེ།
en: Bodhisattvas use this power of actualized miraculous emanations—uncontrived, unobscured, and more exalted than anything in the world—to serve beings.

source: ཇི་ལྟར་འདོད་པ་དེ་ལྟར་བྱིན་གྱིས་རློབ་བོ། །ཇི་ལྟར་འདོད་པ་དེ་བཞིན་དུ་ཡུལ་རྣམས་སྟོན་ཏོ། །
en: They can fulfill any desires and manifest any desired object.

source: བྱང་ཆུབ་སེམས་དཔའ་དེའི་རྫུ་འཕྲུལ་གྱི་དབང་ནི་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པར་འཇུག་སྟེ།
en: The miraculous power of a bodhisattva is used in any situation without hindrance.

source: དེ་གལ་ཏེ་སེམས་ཅན་གཅིག་ཅིག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཟུགས་ཀྱིས་འདུལ་བར་གྱུར་ན། སེམས་ཅན་གཅིག་པོ་དེའི་མདུན་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཟུགས་སྣོད་ཇི་ལྟ་བ་བཞིན་དུ་སྟོན་ཏེ།
en: “If a single being could be tamed by the forms of all beings, then a bodhisattva would display the full complement of all beings as needed in the presence of that single being.

source: སྤྲུལ་པ་དེ་དག་ཐམས་ཅད་ཀྱང་བྱེད་པ་དང་། ཁ་ཟས་དང་། སྨྲ་བ་དང་། སྤྱོད་པ་ཐ་དད་དུ་འཇུག་གོ། །
en: Those emanations will act, eat, speak, and behave in different ways.

source: དེ་འདོད་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཟུགས་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་མོས་ན་ཡང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཟུགས་སངས་རྒྱས་ཀྱི་གཟུགས་སུ་འགྱུར་རོ། །
en: If desired, if bodhisattvas have the conviction that the bodies of all beings are buddha bodies, then the bodies of all beings will become buddha bodies.

source: སངས་རྒྱས་ཀྱི་གཟུགས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཟུགས་སུ་མོས་ན་ཡང་སངས་རྒྱས་ཀྱི་གཟུགས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཟུགས་སུ་འགྱུར་རོ། །
en: If they have the conviction that the bodies of buddhas are the bodies of beings, then the bodies of the buddhas will become the bodies of beings.

source: འཇིག་པའི་བསྐལ་པ་འཆགས་པའི་བསྐལ་པར་མོས་ན་ཡང་འཇིག་པའི་བསྐལ་པ་འཆགས་པའི་བསྐལ་པར་འགྱུར་ཏེ།
en: If they have the conviction that the eon of dissolution is the eon of formation, then the eon of dissolution will become the eon of formation.

source: སེམས་ཅན་དེ་དག་གིས་ཀྱང་འཆགས་པའི་བསྐལ་པར་ཤེས་སོ། །
en: Beings will understand it to be the eon of formation.

source: འཆགས་པའི་བསྐལ་པ་འཇིག་པའི་བསྐལ་པར་མོས་ན་ཡང་འཆགས་པའི་བསྐལ་པ་འཇིག་པའི་བསྐལ་པར་འགྱུར་ཏེ།
en: If bodhisattvas have the conviction that the eon of formation is the eon of dissolution, then the eon of formation will become the eon of dissolution.

source: སེམས་ཅན་དེ་དག་གིས་ཀྱང་འཇིག་པའི་བསྐལ་པར་ཤེས་སོ། །
en: Beings will understand it to be the eon of dissolution.

source: འཇིག་པ་དང་འཆགས་པ་ཡང་གཞན་དུ་གྱུར་པ་མ་ཡིན་ཏེ།
en: However, neither the eon of dissolution nor the eon of formation transforms into the other, it is only the conviction that changes.

source: མོས་པ་དེ་ལྟར་ཡང་འགྱུར་རོ། །དེ་བཞིན་དུ་བསྐལ་པ་གཅིག་སྔ་དྲོ་ཙམ་དུ་མོས་ན་ཡང་དེ་ན་སེམས་ཅན་དེ་དག་གིས་བསྐལ་པ་གཅིག་སྔ་དྲོ་ཙམ་དུ་ཤེས་སོ། །
en: Similarly, if they have the conviction that a single eon is only equivalent to a morning, beings will understand a single eon to be equivalent to a morning.

source: སྔ་དྲོ་བསྐལ་པ་ཙམ་དུ་མོས་ན་ཡང་དེ་དེ་བཞིན་དུ་འགྱུར་ཏེ།
en: If they have the conviction that a morning is equivalent to an eon, that will be the case.

source: དེ་ན་སེམས་ཅན་དེ་དག་གིས་དེ་བཞིན་དུ་ཤེས་ཏེ།
en: That is what beings will understand.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་མོས་པ་ལས་བྱུང་བའི་རྫུ་འཕྲུལ་ཞེས་བྱའོ། །
en: These are what are called miraculous emanations born of a bodhisattva’s conviction.

source: དེ་ལ་མངོན་དུ་གྱུར་པའི་རྫུ་འཕྲུལ་ནི་གང་བྱང་ཆུབ་སེམས་དཔའི་བསམ་གྱིས་མི་ཁྱབ་པའི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་དབང་དང་ལྷུན་གྱིས་གྲུབ་པས་བསྒྲིམ་པ་མེད་པར་ཕུན་སུམ་ཚོགས་པ་ཐམས་ཅད་མངོན་དུ་འགྱུར་ཞིང་འགྲུབ་པ་སྟེ།
en: “An actualized miraculous emanation is one that effortlessly accomplishes and makes manifest all manner of auspiciousness spontaneously; it occurs through the force of bodhisattvas’ inconceivable merit and wisdom.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་མངོན་དུ་གྱུར་པའི་རྫུ་འཕྲུལ་ཞེས་བྱའོ། །
en: This is called a bodhisattva’s actualized miraculous emanation.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ལས་བྱུང་བའི་རྫུ་འཕྲུལ་ནི་གང་བྱང་ཆུབ་སེམས་དཔའ་མི་སེམས་མི་འཇུག་ཅིང་ལྷུན་གྱིས་གྲུབ་པས་སེམས་ཅན་དེ་དག་གི་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཟུགས་དང་སྤྱོད་ལམ་ཐ་དད་པར་མཐོང་ཞིང་ཤེས་ཏེ།
en: “A bodhisattva’s miraculous emanations that appear without being contrived are those that a bodhisattva neither intends nor deliberately performs, but which occur spontaneously. That bodhisattva is seen and known in different forms and with different behaviors according to the beliefs of beings.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་འདུ་བྱེད་པ་མེད་པ་ལས་བྱུང་བའི་རྫུ་འཕྲུལ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s miraculous emanations that appear without being contrived.

source: དེ་འཇིག་རྟེན་གྱི་ཁམས་ཇི་སྙེད་ན་སེམས་ཅན་རྣམས་སངས་རྒྱས་འབྱུང་བས་འདུལ་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་སྙེད་དུ་སངས་རྒྱས་འབྱུང་བ་སྟོན་ཏེ། དགའ་ལྡན་གྱི་གནས་ནས་འཆི་འཕོ་བ་དང་། མངལ་དུ་འཇུག་པ་དང་། བཙས་པ་དང་། མངོན་པར་འབྱུང་བ་དང་། དཀའ་བ་སྤྱོད་པ་དང་།
en: “Bodhisattvas display the coming of a buddha in those world systems where beings would be tamed by the coming of a buddha.

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བ་དང་། བདུད་འདུལ་བ་དང་། བྱང་ཆུབ་རྣམ་པར་འཚང་རྒྱ་བ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་བ་དང་། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོ་སྟོན་པ་རྣམས་ཀྱིས་སེམས་ཅན་དག་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །
en: They ripen beings by displaying their passing away in Tuṣita, entering the womb, being born, renouncing their home, practicing austerities, arriving at the seat of awakening, taming Māra, awakening, turning the wheel of Dharma, and passing away in the great final nirvāṇa.

source: དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྫུ་འཕྲུལ་གྱི་ཡུལ་ཚད་མེད་པ་ཡིན་ཏེ།
en: The range of a bodhisattva’s emanations is thus immeasurable.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་བྱ་བ་ཤེས་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s knowledge of the mode of miraculous emanations.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཟག་པ་ཟད་པ་ཤེས་པ་གང་ཞེ་ན། འདི་དག་ནི་ཟག་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན།
en: “What is a bodhisattva’s knowledge of the exhaustion of contaminants?

source: འདོད་པའི་ཟག་པ་དང་། སྲིད་པའི་ཟག་པ་དང་། མ་རིག་པའི་ཟག་པ་དང་། ལྟ་བའི་ཟག་པ་སྟེ།
en: There are four contaminants: desire, existence, ignorance, and view.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ཟག་པ་དེ་དག་ཡོངས་སུ་སྤངས་པ་ཡིན་མ་འོངས་པ་ན་མི་སྐྱེ་བའི་ཆོས་ཅན་དུ་འགྱུར་ཞིང་ཕྱིར་མི་སྐྱེ་མི་འགག་སྟེ།
en: A bodhisattva is someone who has abandoned these contaminants. They will no longer be required to arise, and thereafter will neither arise nor cease.

source: འདུལ་བ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་རྣམས་ལ་ཐམས་ཅད་དུ་སྐྱེ་བ་ཡང་སྟོན་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལྷུན་གྱིས་གྲུབ་པས་རྒྱུན་མི་འཆད་པར་འཇུག་པ་ཞེས་བྱ་སྟེ།
en: They will, nonetheless, arise in any situation and display themselves as needed to tame beings. This is a bodhisattva’s spontaneous and unceasing engagement.

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་དྲུག་གོ། །
en: “These are the six higher cognitions of a bodhisattva.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་རིག་པ་གསུམ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “What are a bodhisattva’s three kinds of knowledge?

source: ལྷའི་མིག་གི་རིག་པ་དང་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་རིག་པ་དང་། ཟག་པ་ཟད་པའི་རིག་པ་སྟེ།
en: The knowledge of divine sight, of recollecting previous states, and of the exhaustion of the contaminants.

source: རིག་པ་ནི་ཤེས་པ་ཞེས་བྱའོ། །
en: ‘Knowledge’ is a type of knowing.

source: དེ་ལ་ལྷའི་མིག་གི་ཤེས་པ་ནི་ལྷའི་མིག་གི་རིག་པ་ཡིན་ནོ། །
en: “The knowledge of divine sight is divine sight as knowing.

source: ལྷའི་མིག་གི་རིག་པ་གང་ཡིན་པ་དེ་ནི་རྣམ་པར་དག་པའི་ལྷའི་མཆོག་རྣམས་ཀྱི་ཡིན་ཏེ།
en: The knowledge of divine sight belongs to the most supreme of the pure deities.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་ལྷའི་མིག་གི་རིག་པ་དེ་དང་ལྡན་པ་ཡིན་ནོ། །
en: The bodhisattva is the one who possesses this knowledge of divine sight.

source: རྣམ་པར་དག་པའི་ལྷ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཏེ། དེ་དག་ནི་རྣམ་པར་དག་པའི་ལྷའོ། །
en: Śrāvakas, pratyekabuddhas, and bodhisattvas are pure deities.

source: རྣམ་པར་དག་པའི་ལྷ་དེ་དག་གི་མཆོག་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཏེ།
en: They are pure deities, while the most exalted of those pure deities are the thus-gone, worthy, completely perfect buddhas.

source: རྣམ་པར་དག་པའི་ལྷའི་མཆོག་རྣམས་ཞེས་བྱའོ། །
en: They are called the most supreme of the pure deities.

source: བྱང་ཆུབ་སེམས་དཔས་ནི་རྣམ་པར་དག་པའི་ལྷའི་མཆོག་རྣམས་ཀྱི་ལྷའི་མིག་གི་རིག་པ་གང་ཡིན་པ་དེ་འཐོབ་སྟེ།
en: Bodhisattvas acquire the knowledge of the divine sight of the most supreme of the pure deities, unlike śrāvakas and pratyekabuddhas.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་ལྟར་མ་ཡིན་པ་དེ་ནི་རིག་པ་དང་པོའོ། །
en: This is the first of the knowledges. “Next is the knowledge of recalling previous states.

source: དེ་ལ་སྔོན་གྱི་གནས་རྗེས་སུ་དྲན་པའི་རིག་པ་ནི་དེ་བཞིན་གཤེགས་པ་ལ་སྔོན་གྱི་མཐའ་མི་མཁྱེན་པའམ། མི་རིག་པའམ། མི་རྟོགས་པ་གང་ཡང་མི་མངའོ། །
en: Thus-gone-ones are not unknowing about, not ignorant of, and not unaware of their previous existences.

source: བྱང་ཆུབ་སེམས་དཔའ་ནི་རིག་པ་དེ་ཐོབ་སྟེ།
en: Bodhisattvas acquire this knowledge, unlike śrāvakas and pratyekabuddhas.

source: ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་ལྟར་མ་ཡིན་པ་འདི་ནི་རིག་པ་གཉིས་པའོ། །
en: This is the second of the knowledges.

source: དེ་ལ་ཟག་པ་ཟད་པའི་རིག་པ་གང་ཞེ་ན།
en: “What is the knowledge of the exhaustion of the contaminants?

source: ཟག་པ་བཞི་སྟེ། བཞི་གང་ཞེ་ན། འདོད་པའི་ཟག་པ་དང་། སྲིད་པའི་ཟག་པ་དང་། མ་རིག་པའི་ཟག་པ་དང་།
en: There are four contaminants: desire, existence, ignorance, and view.

source: ལྟ་བའི་ཟག་པ་སྟེ། ཟག་པ་དེ་དག་བྱང་ཆུབ་སེམས་དཔས་བག་ཆགས་དང་བཅས་པར་སྤོང་བའི་ལམ་གྱིས་མངོན་པར་རྟོགས་ཏེ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་རྣམས་ཀྱི་ལྟར་ཉོན་མོངས་པའི་སྒྲིབ་པ་སྤོང་བའི་ལམ་གྱིས་ནི་མ་ཡིན་ནོ། །
en: A bodhisattva gains direct realization by training in the abandonment of these contaminants along with their habitual patterns, not by training in the abandonment of the obscuration of the afflictive emotions as śrāvakas and pratyekabuddhas do.

source: དེ་ཟག་པ་ཟད་ནས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སྐྱེ་བའི་གནས་ཐམས་ཅད་དུ་སྐྱེ་བ་ཡོངས་སུ་འཛིན་པ་ཐོགས་པ་མེད་པ་ཡིན་ཏེ།
en: Once these contaminants have been exhausted, bodhisattvas are unobstructed, and continue to take birth in any of the birth states in order to ripen beings.

source: འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཟག་པ་ཟད་པའི་རིག་པ་ཞེས་བྱའོ། །
en: This is known as a bodhisattva’s ‘knowledge of the exhaustion of the contaminants.’

source: འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་རིག་པ་གསུམ་མོ། །
en: “These are the three kinds of knowledge of a bodhisattva.

source: དེ་ལ་རྣམ་པར་ཐར་པ་བརྒྱད་གང་ཞེ་ན།
en: “What are the eight liberations?

source: གཟུགས་ཅན་གཟུགས་རྣམས་ལ་ལྟ་བ་འདི་ནི་རྣམ་པར་ཐར་པ་དང་པོའོ། །
en: The first liberation is observing form while in the form realm.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་རྣམས་ལ་ལྟ་བ་འདི་ནི་རྣམ་པར་ཐར་པ་གཉིས་པའོ། །
en: The second liberation is observing forms externally while perceiving the formless internally.

source: སྡུག་པར་མོས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་གསུམ་པའོ། །
en: The third liberation is interest in what is attractive.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ་ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་། སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བཞི་པའོ། །
en: The fourth liberation is transcending the perceptions of form in all aspects, letting inhibiting perceptions end, and then perfecting and remaining within the scope of infinite space by ignoring various perceptions upon thinking, ‘This is infinite space.’

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་ལྔ་པའོ། །
en: The fifth liberation is transcending the scope of infinite space in all aspects, and then perfecting and remaining within the scope of infinite consciousness upon thinking, ‘This is infinite consciousness.’

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་ཅི་ཡང་མེད་དོ་སྙམ་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་དྲུག་པའོ། །
en: The sixth liberation is transcending the scope of infinite consciousness in all aspects, and then perfecting and remaining within the scope of nothingness after thinking, ‘There is nothing at all.’

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ནས་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བདུན་པའོ། །
en: The seventh liberation is transcending the scope of nothingness in all aspects, and then perfecting and remaining within the scope of neither perception nor nonperception.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་རྫོགས་པར་བྱས་ནས་གནས་པ་འདི་ནི་རྣམ་པར་ཐར་པ་བརྒྱད་པའོ། །
en: The eighth liberation is transcending the sphere of neither perception nor nonperception, and then perfecting and remaining within the state of the cessation of perception and sensation.

source: དེ་ལ་ཇི་ལྟར་གཟུགས་ཅན་གཟུགས་རྣམས་ལ་བལྟ་ཞེ་ན།
en: “What does it mean to observe form while in the form realm?

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་སྟོང་པ་དང་གཡོ་བ་མེད་པར་བལྟ་བ་སྟེ།
en: It means to see form as dependently arisen, empty, and unmoving.

source: དེ་ལྟར་ལྟ་བས་རྣམ་པར་གྲོལ་ཏེ།
en: Observing this, one is liberated.

source: དེའི་ཕྱིར་རྣམ་པར་ཐར་པ་ཞེས་བྱའོ། །
en: This is why it is called a liberation.

source: ནང་གཟུགས་མེད་པར་འདུ་ཤེས་པས་ཕྱི་རོལ་གྱི་གཟུགས་རྣམས་ལ་བལྟ་བ་ནི་སྟོང་པ་ཉིད་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་དང་། གཡོ་བ་མེད་པ་དེ་ལྟར་བལྟ་བས་རྣམ་པར་གྲོལ་ཏེ།
en: “Observing forms externally while perceiving the formless internally means to see the formless as dependently arisen, empty, and unmoving, and thereby being liberated.

source: སྡུག་པར་མོས་པ་ཡིན་ཏེ།
en: “Interest in what is attractive can be understood as follows.

source: སྡུག་པ་ཞེས་བྱ་བ་ནི་སྟོང་པའོ། །མི་སྡུག་པ་ནི་ལྟ་བར་གྱུར་པའོ། །
en: Attractive refers to that which is empty; it is unattractive to hold a view.

source: སྡུག་པར་མོས་པས་རྣམ་པར་གྲོལ་ཏེ།
en: By taking an interest in what is attractive, one is liberated.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ་ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་སོ་ཞེས་བྱ་བ་ལ་ནམ་མཁའ་མཐའ་ཡས་སོ་ཞེས་བྱ་བའི་ནམ་མཁའ་ནི་སྟོང་པའོ། །དེ་ལྟར་མཐོང་བས་རྣམ་པར་གྲོལ་ཏེ།
en: “Transcending the perceptions of form in all aspects, letting inhibiting perceptions end, and then perfecting and remaining within the scope of infinite space by ignoring various perceptions upon thinking, ‘This is infinite space,’ refers to the fact that space is empty, and observing this results in liberation.

source: རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་ཞེས་བྱ་བ་ལ་རྣམ་ཤེས་མཐའ་ཡས་ཞེས་བྱ་བའི་རྣམ་པར་ཤེས་པ་དེ་ནི་ཐོག་མ་མེད་པ་ཅན་དུ་བཤད་དེ།
en: “Transcending the scope of infinite space in all aspects, and then perfecting and remaining within the scope of infinite consciousness upon thinking, ‘This is infinite consciousness,’ can be understood as follows. Infinite consciousness refers to a consciousness described as ‘unobstructed.’

source: གང་ཐོག་མ་མེད་པ་ཅན་དེ་ནི་སྟོང་པའོ། །
en: That which is unobstructed is empty.

source: དེ་ལྟར་མཐོང་བས་རྣམ་པར་གྲོལ་ཏེ།
en: Observing this, one is liberated.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་ཅི་ཡང་མེད་དོ་སྙམ་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ཏེ་གནས་ཞེས་བྱ་བ་ལ་ཅི་ཡང་ཞེས་བྱ་བ་ནི་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་རྣམས་སོ། །
en: “Transcending the scope of infinite consciousness in all aspects, and then perfecting and remaining within the scope of nothingness upon thinking, ‘There is nothing at all,’ can be understood as follows. The phrase at all refers to desire, anger, and dullness.

source: ཅི་ཡང་མེད་པ་ཞེས་བྱ་བ་ནི་དེ་དག་མེད་པའོ། །
en: Nothing means that they do not exist.

source: དེ་ལྟར་མཐོང་བས་རྣམ་པར་འགྲོལ་ཏེ།
en: Observing this, one is liberated.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་རྫོགས་པར་བྱས་ནས་གནས་ཞེས་བྱ་བ་ལ་འདུ་ཤེས་མེད་ཅེས་བྱ་བ་ནི་སྟོང་པའི་ཕྱིར་རོ། །
en: “Transcending the scope of nothingness in all aspects, and then perfecting and remaining within the scope of neither perception nor nonperception can be understood as follows.

source: འདུ་ཤེས་མེད་མིན་ཞེས་བྱ་བ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་ཕྱིར་རོ། །
en: Neither perception is said because perception is empty; nor nonperception is said because it arises dependently.

source: དེ་རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ། འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་རྫོགས་པར་བྱས་ནས་གནས་ཞེས་བྱ་བ་ནི་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: “Transcending the sphere of neither perception nor nonperception, and then perfecting and remaining within the state of the cessation of perception and sensation can be understood as follows.

source: འདུ་ཤེས་ནི་སྨིག་རྒྱུ་ལྟ་བུ། ཚོར་བ་ནི་ཆུའི་ཆུ་བུར་ལྟ་བུ་སྟེ།
en: One thinks, ‘Perceptions are like illusions, and sensations are like bubbles on water.
